Repository: farah-Mimouni/Rana-jayeen
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# locationPermissionMessage
source: Please allow location access to find nearby service providers
ar: الرجاء السماح بالوصول إلى الموقع للعثور على مقدمي الخدمات القريبين
fr: Veuillez autoriser l'accès à la localisation pour trouver les prestataires de services à proximité

source: Allow
ar: السماح
fr: Autoriser

source: Go to Login
ar: الذهاب إلى تسجيل الدخول
fr: Aller à la connexion

# serverTimeout
source: The server took too long to respond.
ar: استغرق الخادم وقتًا طويلاً للرد.
fr: Le serveur a mis trop de temps à répondre.

# authError
source: Failed to verify login. Try again.
ar: فشل التحقق من تسجيل الدخول. حاول مرة أخرى.
fr: Échec de la vérification de la connexion. Réessayez.

source: Checking login status...
ar: انتظر قليلا لتحميل معلوماتك..
fr: Vérification de l'état de la connexion...

# welcome1Title
source: Smart Assistance
ar: مساعدة ذكية
fr: Assistance intelligente

# welcome1Desc
source: A smart app that helps you fix vehicle breakdowns
ar: هو تطبيق ذكي يساعدك في حل الأعطال التي تتعرض لها مركبتك
fr: Une application intelligente qui vous aide à résoudre les pannes de votre véhicule

# welcome2Title
source: Expert Technicians
ar: فنيون متخصصون
fr: Techniciens spécialisés

# welcome2Desc
source: We provide the most experienced and nearest technicians to get you out of trouble
ar: سنوفر اكثر الاشخاص خبرة و الاقرب اليك لاخراجك من المأزق
fr: Nous fournissons les techniciens les plus expérimentés et les plus proches pour vous sortir d'ennui

# welcome3Title
source: Additional Services
ar: خدمات إضافية
fr: Services supplémentaires

# welcome3Desc
source: You can also benefit from our additional services like reporting and car rental...
ar: يمكنك ايضا الاستفادة من خدماتنا الاضافية الابلاغ و استئجار سيارات ...
fr: Vous pouvez également bénéficier de nos services supplémentaires comme le signalement et la location de voitures...

# welcome4Title
source: 24/7 Support
ar: دعم على مدار الساعة
fr: Support 24/7

# welcome4Desc
source: We are with you wherever you are If you want to save time and money, choose us
ar: سنكون معكم اينما كنتكم ان كنت تريد ان توفر الوقت و المال فاخترنا
fr: Nous sommes avec vous où que vous soyez Si vous voulez gagner du temps et de l'argent, choisissez-nous

# continueButton
source: Continue
ar: متابعة
fr: Continuer

# nextButton
source: Next
ar: التالي
fr: Suivant

# skipButton
source: Skip
ar: تخطي
fr: Passer

source: Anonymous User
ar: مستخدم مجهول
fr: Utilisateur anonyme

source: No chats found
ar: لم يتم العثور على محادثات
fr: Aucun chat trouvé

source: Message queued
ar: تم وضع الرسالة في قائمة الانتظار
fr: Message en file d'attente

source: About
ar: حول
fr: À propos

source: About Us
ar: من نحن
fr: À propos de nous

# aboutUsDesc
source: We connect you with trusted car repair professionals to get you back on the road quickly.
ar: نربطك بمحترفي إصلاح السيارات الموثوقين لإعادتك إلى الطريق بسرعة.
fr: Nous vous mettons en relation avec des professionnels de la réparation automobile fiables pour vous remettre sur la route rapidement.

source: AC Repair
ar: إصلاح التكييف
fr: Réparation de climatisation

# addComment
source: Add a Comment
ar: أضف تعليقًا
fr: Ajouter un commentaire

source: Add Content
ar: إضافة محتوى
fr: Ajouter du contenu

source: Add from Gallery
ar: إضافة من المعرض
fr: Ajouter depuis la galerie

source: Additional Feedback
ar: تعليقات إضافية
fr: Commentaires supplémentaires

# additional_info
source: Additional Information
ar: معلومات إضافية
fr: Informations supplémentaires

# addressError
source: Failed to fetch address
ar: فشل في جلب العنوان
fr: Échec de la récupération de l'adresse

# addressFetchError
source: Failed to retrieve address.
ar: فشل في الحصول على العنوان.
fr: Impossible de récupérer l'adresse.

# addressFetchFailed
source: Failed to fetch address, please try again
ar: فشل في جلب العنوان، حاول مرة أخرى
fr: Échec de la récupération de l'adresse, veuillez réessayer

# address_error
source: Error fetching address. Please try again.
ar: خطأ في جلب العنوان. يرجى المحاولة مرة أخرى.
fr: Erreur lors de la récupération de l'adresse. Veuillez réessayer.

source: Advice
ar: نصائح
fr: Conseils

source: Alert
ar: تنبيه
fr: Alerte

# alertComingSoon
source: The emergency alert feature is currently under development and will be available in an upcoming update. Thank you for your understanding!
ar: يتم حالياً العمل على ميزة التنبيه في حالات الطوارئ وسوف تكون متاحة في تحديث قادم. نقدر تفهمكم!
fr: La fonctionnalité d'alerte d'urgence est actuellement en cours de développement et sera disponible dans une prochaine mise à jour. Merci de votre compréhension !

source: All
ar: الكل
fr: Tous

source: All Categories
ar: جميع الفئات
fr: Toutes les catégories

source: All Services
ar: جميع الخدمات
fr: Tous les services

# all_providers_busy
source: All available providers are busy
ar: جميع المزودين المتاحين مشغولون
fr: Tous les prestataires disponibles sont occupés

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟
fr: Vous avez déjà un compte ?

source: Ambulance
ar: الإسعافات

# ambulanceDescription
source: Your safety matters. In case of an emergency, you can call directly or send an alert or message with your location.
ar: يهمنا سلامتك. فور حدوث أي طارئ، يمكنك الاتصال مباشرة أو إرسال تنبيه أو رسالة مع موقع تواجدك.
fr: Votre sécurité compte. En cas d'urgence, vous pouvez appeler directement ou envoyer une alerte ou un message avec votre position.

# apiBlockedError
source: YouTube API is currently blocked. Please try again later or contact support.
ar: واجهة برمجة يوتيوب محظورة حاليًا. يرجى المحاولة مرة أخرى لاحقًا أو التواصل مع الدعم.
fr: L'API YouTube est actuellement bloquée. Veuillez réessayer plus tard ou contacter le support.

# apiInvalidError
source: YouTube API key is invalid. Please contact support.
ar: مفتاح واجهة برمجة يوتيوب غير صالح. يرجى التواصل مع الدعم.
fr: La clé de l'API YouTube est invalide. Veuillez contacter le support.

# appDescription
source: An app offering a range of services for all road users and car owners.
ar: تطبيق يقدم مجموعة من الخدمات لكل مستعملي الطرقات ومستقلي السيارات.
fr: Une application offrant une gamme de services pour tous les usagers de la route et les propriétaires de voitures.

# appLogo
source: We Are Coming Logo
ar: شعار رانا جايين
fr: Logo Nous Arrivons

# appRating
source: Rate Our App
ar: قيم تطبيقنا
fr: Évaluez notre application

source: Appointment Time
ar: وقت الموعد
fr: Heure du rendez-vous

# appointmentTimeError
source: Please select an appointment time
ar: يرجى اختيار وقت الموعد
fr: Veuillez sélectionner une heure de rendez-vous

source: Appointment Booked
ar: تم حجز الموعد
fr: Rendez-vous réservé

source: Arabic
ar: العربية
fr: Arabe

# arrivalTimeError
source: Error updating arrival time.
ar: خطأ في تحديث وقت الوصول.
fr: Erreur lors de la mise à jour de l'heure d'arrivée.

source: Articles
ar: المقالات

# assigned_provider_info
source: Assigned Provider Information
ar: معلومات مقدم الخدمة المعين
fr: Informations sur le prestataire assigné

# assigned_to_request
source: Assigned to your request!
ar: تم تعيينه لطلبك!
fr: Assigné à votre demande !

# authenticationFailed
source: Authentication failed: {error}
ar: فشل المصادقة: {error}
fr: Échec de l'authentification : {error}

# available
source: Available Providers
ar: مقدمو الخدمة المتاحون
fr: Prestataires disponibles

source: Back
ar: رجوع
fr: Retour

# batteryChargeDescription
source: On-site car battery charging or replacement
ar: شحن أو استبدال بطارية السيارة في الموقع
fr: Recharge ou remplacement de la batterie de voiture sur place

# batteryChargeTitle
source: Battery Charge or Replacement
ar: شحن أو استبدال البطارية
fr: Recharge ou remplacement de batterie

# batteryChargeType
source: Battery Charge
ar: شحن البطارية
fr: Recharge de batterie

source: Battery Replacement
ar: استبدال البطارية
fr: Remplacement de batterie

# becauseWeCome
source: Because we come to you with what you need, anytime, anywhere.
ar: لأننا نأتي إليك بما تحتاجه في أي زمان أو مكان.
fr: Parce que nous venons à vous avec ce dont vous avez besoin, à tout moment, n'importe où.

source: Book Now
ar: احجز الآن
fr: Réserver maintenant

source: Booking Confirmed
ar: تم تأكيد الحجز
fr: Réservation confirmée

source: Booking Summary
ar: ملخص الحجز
fr: Résumé de la réservation

source: Brake Repair
ar: إصلاح الفرامل
fr: Réparation des freins

# brakeServiceDescription
source: Brake system repair and maintenance for safety.
ar: إصلاح وصيانة نظام الفرامل للأمان.
fr: Réparation et entretien du système de freinage pour la sécurité.

# brakeServiceTitle
source: Brake Repair
ar: إصلاح الفرامل
fr: Réparation des freins

source: Brands
ar: علامات تجارية
fr: Marques

source: Browse Posts
ar: تصفح المنشورات
fr: Parcourir les publications

source: Call
ar: الاتصال
fr: Appeler

# callDriver
source: Call Provider
ar: الاتصال بمقدم الخدمة
fr: Appeler le prestataire

# callError
source: Failed to make phone call.
ar: فشل في إجراء المكالمة الهاتفية.
fr: Échec de l'appel téléphonique.

# callFailed
source: Unable to make call
ar: لا يمكن إجراء المكالمة
fr: Impossible d'effectuer l'appel

source: Call Provider
ar: الاتصال بالمزود
fr: Appeler le prestataire

source: Call Us
ar: اتصل بنا
fr: Appelez-nous

source: Call Now
ar: الاتصال الآن
fr: Appeler maintenant

source: Call Provider
ar: الاتصال بمقدم الخدمة
fr: Appeler le prestataire

source: Call Provider Button
ar: زر الاتصال بمقدم الخدمة
fr: Bouton d'appel du prestataire

source: Cancel
ar: إلغاء
fr: Annuler

source: Cancel Request
ar: إلغاء الطلب
fr: Annuler la demande

source: Cancel Service
ar: إلغاء الخدمة
fr: Annuler le service

source: Cancel Request
ar: إلغاء الطلب
fr: Annuler la demande

source: Cancel Request Button
ar: زر إلغاء الطلب
fr: Bouton d'annulation de la demande

# cannot_make_call
source: Unable to make a call to
ar: غير قادر على إجراء مكالمة إلى
fr: Impossible d'appeler

source: Car
ar: سيارة
fr: Voiture

# carACServiceDescription
source: Car AC system repair or recharge
ar: إصلاح أو إعادة شحن نظام تكييف السيارة
fr: Réparation ou recharge du système de climatisation de voiture

# carACServiceTitle
source: Car AC Service
ar: خدمة تكييف السيارة
fr: Service de climatisation de voiture

# carElectricianDescription
source: Diagnosis and repair of car electrical systems
ar: تشخيص وإصلاح الأنظمة الكهربائية للسيارة
fr: Diagnostic et réparation des systèmes électriques de voiture

# carElectricianTitle
source: Car Electrician
ar: كهربائي سيارات
fr: Électricien automobile

source: Car Fixes & Tips
ar: إصلاح السيارات ونصائح
fr: Réparations et conseils automobiles

# carInspectionDescription
source: Comprehensive car inspection before purchase or periodically
ar: فحص شامل للسيارة قبل الشراء أو بشكل دوري
fr: Inspection complète de la voiture avant achat ou périodiquement

# carInspectionTitle
source: Car Inspection
ar: فحص السيارة
fr: Inspection de voiture

# carMechanicDescription
source: General car mechanical repairs at your location
ar: إصلاحات ميكانيكية عامة للسيارة في موقعك
fr: Réparations mécaniques générales de voiture à votre emplacement

# carMechanicTitle
source: Car Mechanic
ar: ميكانيكي سيارات
fr: Mécanicien automobile

source: Car Rental
ar: تأجير السيارات
fr: Location de voitures

# carRentalDescription
source: Convenient car rental services
ar: خدمات تأجير السيارات المريحة
fr: Services de location de voitures pratiques

# carRentalTitle
source: Car Rental
ar: تأجير السيارات
fr: Location de voitures

source: Car Unlock
ar: فتح السيارة
fr: Déverrouillage de voiture

source: Car Wash
ar: غسيل السيارات
fr: Lavage de voiture

# carWashDescription
source: Professional car cleaning services
ar: خدمات تنظيف السيارات الاحترافية
fr: Services de nettoyage de voiture professionnels

# carWashTitle
source: Car Wash
ar: غسيل السيارات
fr: Lavage de voiture

source: Cars
ar: سيارات
fr: Voitures

# cashback
source: 20% Cashback
ar: استرداد نقدي 20%
fr: Remboursement de 20%

source: Category
ar: الفئة
fr: Catégorie

# center_map
source: Center Map on My Location
ar: تمركز الخريطة على موقعي
fr: Centrer la carte sur ma position

source: Change Address
ar: تغيير العنوان
fr: Changer l'adresse

source: Change Location
ar: تغيير الموقع
fr: Changer de lieu

# changeLocationTitle
source: Change Location
ar: تغيير الموقع
fr: Changer de lieu

source: Change Phone Number
ar: تغيير رقم الهاتف
fr: Changer le numéro de téléphone

source: Change Address
ar: تغيير العنوان
fr: Changer l'adresse

source: Change Location
ar: تغيير الموقع
fr: Changer de lieu

source: Change Location Button
ar: زر تغيير الموقع
fr: Bouton de changement d'emplacement

source: Chat
ar: دردشة

source: Chat Now
ar: دردش الآن
fr: Chatter maintenant

# chat_initiated
source: Chat initiated for {serviceTitle}
ar: تم بدء الدردشة لـ {serviceTitle}
fr: Chat initié pour {serviceTitle}

# chat_queued
source: Chat queued to be sent when internet is available
ar: تمت إضافة الدردشة إلى قائمة الانتظار ليتم إرسالها عند الاتصال بالإنترنت
fr: Chat mis en file d'attente pour être envoyé lorsque la connexion Internet est disponible

source: Choose Language
ar: اختر اللغة
fr: Choisir la langue

source: Civil Protection
ar: الحماية المدنية
fr: Protection civile

# civilProtectionDescription
source: Your safety matters. In case of an emergency, you can call directly or send an alert or message with your location.
ar: يهمنا سلامتك. فور حدوث أي طارئ، يمكنك الاتصال مباشرة أو إرسال تنبيه أو رسالة مع موقع تواجدك.
fr: Votre sécurité compte. En cas d'urgence, vous pouvez appeler directement ou envoyer une alerte ou un message avec votre position.

source: Close
ar: إغلاق
fr: Fermer

source: Comfortable Sedan
ar: سيدان مريح
fr: Berline confortable

source: Coming Soon!
ar: قريباً!
fr: Bientôt disponible !

# commentError
source: Error posting comment
ar: حدث خطأ أثناء نشر التعليق
fr: Erreur lors de la publication du commentaire

# commentPosted
source: Comment posted successfully
ar: تم نشر التعليق بنجاح
fr: Commentaire publié avec succès

source: Comments
ar: التعليقات
fr: Commentaires

# completeRegistrationMessage
source: Enter your details to get started.
ar: أدخل تفاصيلك للبدء.
fr: Entrez vos informations pour commencer.

source: Confirm Code
ar: تأكيد الرمز
fr: Confirmer le code

source: Confirm Delete Post
ar: تأكيد حذف المنشور
fr: Confirmer la suppression de la publication

# confirmDeletePostMessage
source: Are you sure you want to delete this post? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد حذف هذا المنشور؟ لا يمكن التراجع عن هذا الإجراء.
fr: Êtes-vous sûr de vouloir supprimer cette publication ? Cette action est irréversible.

source: Confirm Subscribe
ar: تأكيد الاشتراك
fr: Confirmer l'abonnement

# confirmSubscribeMessage
source: Do you want to subscribe to this user's content?
ar: هل تريد الاشتراك في محتوى هذا المستخدم؟
fr: Voulez-vous vous abonner au contenu de cet utilisateur ?

source: Confirm Unsubscribe
ar: تأكيد إلغاء الاشتراك
fr: Confirmer le désabonnement

# confirmUnsubscribeMessage
source: Do you want to unsubscribe from this user's content?
ar: هل تريد إلغاء الاشتراك من محتوى هذا المستخدم؟
fr: Voulez-vous vous désabonner du contenu de cet utilisateur ?

source: Confirm Verification Code
ar: تأكيد رمز التحقق
fr: Confirmer le code de vérification

source: Connection restored
ar: تم استعادة الاتصال
fr: Connexion rétablie

source: Contact
ar: الاتصال

# contactProvider
source: Contacting
ar: جاري التواصل مع
fr: Contacter

source: Contact Us
ar: اتصل بنا
fr: Contactez-nous

# contact_provider_button
source: Contact Provider
ar: التواصل مع مقدم الخدمة
fr: Contacter le prestataire

source: Contacting driver
ar: جارٍ التواصل مع السائق
fr: Contacter le chauffeur

source: Content
ar: المحتوى
fr: Contenu

# currency
source: dz
ar: دج

source: Current Location
ar: الموقع الحالي
fr: Emplacement actuel

source: Dashboard
ar: لوحة التحكم
fr: Tableau de bord

# dataError
source: Error loading data.
ar: خطأ في تحميل البيانات.
fr: Erreur de chargement des données.

# dataSavedError
source: Error saving data: {error}
ar: خطأ في حفظ البيانات: {error}
fr: Erreur lors de l'enregistrement des données : {error}

# dataSavedSuccess
source: Data saved successfully
ar: تم حفظ البيانات بنجاح
fr: Données enregistrées avec succès

source: Date
ar: التاريخ

# dateError
source: Please select a wash date
ar: يرجى اختيار تاريخ الغسيل
fr: Veuillez sélectionner une date de lavage

source: Date of Wash
ar: تاريخ الغسيل
fr: Date de lavage

source: Days
ar: أيام
fr: Jours

# days_ago
source: {count, plural, zero{0 days ago} one{1 day ago} other{{count} days ago}}
ar: {count, plural, zero{قبل 0 أيام} one{قبل يوم واحد} other{قبل {count} أيام}}
fr: {count, plural, zero{il y a 0 jour} one{il y a 1 jour} other{il y a {count} jours}}

# defaultSort
source: Default
ar: الافتراضي
fr: Par défaut

# default_location
source: Default Location (Algeria)
ar: الموقع الافتراضي (الجزائر)
fr: Emplacement par défaut (Algérie)

source: Delete
ar: حذف
fr: Supprimer

source: Delete Post
ar: حذف المنشور
fr: Supprimer la publication

source: Delivery Option
ar: خيار التوصيل
fr: Option de livraison

# delivery_option_subtitle
source: Choose whether you want the service delivered to you
ar: اختر ما إذا كنت تريد توصيل الخدمة إليك
fr: Choisissez si vous souhaitez que le service soit livré à vous

# desc_bmw_r1250gs
source: Touring motorcycle with luxury features
ar: دراجة نارية سياحية بميزات فاخرة
fr: Moto de tourisme avec des fonctionnalités de luxe

# desc_chevrolet_silverado
source: Large truck with strong towing capacity
ar: شاحنة كبيرة بسحب قوي
fr: Gros camion avec une forte capacité de remorquage

# desc_ford_f150
source: Pickup truck with robust capabilities
ar: شاحنة صغيرة ذات قدرات قوية
fr: Camionnette avec des capacités robustes

# desc_ford_mustang
source: Powerful American car with outstanding performance
ar: سيارة أمريكية قوية ذات أداء متميز
fr: Voiture américaine puissante avec des performances exceptionnelles

# desc_harley_sportster
source: Classic motorcycle with timeless design
ar: دراجة نارية كلاسيكية بتصميم خالد
fr: Moto classique avec un design intemporel

# desc_honda_cbr600rr
source: High-performance sports bike for enthusiasts
ar: دراجة نارية رياضية عالية الأداء للهواة
fr: Moto sportive haute performance pour les passionnés

# desc_honda_civic
source: Compact sports car with excellent handling
ar: سيارة رياضية صغيرة مع قيادة ممتازة
fr: Voiture compacte sportive avec une excellente maniabilité

# desc_toyota_corolla
source: Reliable, fuel-efficient sedan with modern features
ar: سيارة سيدان موثوقة وموفرة للوقود مع ميزات حديثة
fr: Berline fiable et économe en carburant avec des fonctionnalités modernes

# desc_toyota_tacoma
source: Mid-size truck known for durability and off-road performance
ar: شاحنة متوسطة معروفة بمتانتها وأدائها على الطرق الوعرة
fr: Camion de taille moyenne connu pour sa durabilité et ses performances tout-terrain

source: Description
ar: الوصف

source: Determining provider location...
ar: جاري تحديد موقع مقدم الخدمة...
fr: Détermination de l'emplacement du prestataire...

source: Diagnostic
ar: التشخيص

# discountBanner
source: Summer Surprise
ar: مفاجأة صيفية
fr: Surprise d'été

source: Dismiss
ar: إغلاق
fr: Ignorer

source: Distance
ar: المسافة

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
fr: Vous n'avez pas de compte ?

source: Driver
ar: سائق
fr: Chauffeur

# driverArrived
source: Provider Arrived
ar: وصل مقدم الخدمة
fr: Prestataire arrivé

# driverComing
source: Provider arriving in
ar: مقدم الخدمة قادم خلال
fr: Prestataire arrive dans

# driverHasArrived
source: Provider has arrived
ar: وصل مقدم الخدمة
fr: Le prestataire est arrivé

# driverIconLoadFailed
source: Failed to load provider icon
ar: فشل في تحميل أيقونة مقدم الخدمة
fr: Échec du chargement de l'icône du prestataire

# driverIncluded
source: Includes Driver
ar: يشمل السائق
fr: Chauffeur inclus

# driverInfo
source: Provider Information
ar: معلومات مقدم الخدمة
fr: Informations sur le prestataire

# driverInfoError
source: Error retrieving provider information.
ar: خطأ في استرجاع معلومات مقدم الخدمة.
fr: Erreur lors de la récupération des informations du prestataire.

# driverIsComing
source: Provider is coming - Arrival time:
ar: مقدم الخدمة قادم - وقت الوصول:
fr: Le prestataire arrive - Heure d'arrivée :

# driverOnWay
source: Provider on the Way
ar: مقدم الخدمة في طريقه
fr: Prestataire en route

# driverSearchError
source: Failed to find providers.
ar: فشل في العثور على مزودين.
fr: Échec de la recherche de prestataires.

# driverToDestination
source: On the way to destination
ar: في طريقه إلى الوجهة
fr: En route vers la destination

# driver_info_not_found
source: Driver data not available
ar: بيانات السائق غير متوفرة
fr: Données du chauffeur non disponibles

source: Edit Post
ar: تعديل المنشور
fr: Modifier la publication

source: Email
ar: البريد الإلكتروني

source: Email Us
ar: راسلنا عبر البريد الإلكتروني
fr: Envoyez-nous un e-mail

source: Emergencies
ar: الطوارئ
fr: Urgences

source: Emergency Repair
ar: إصلاح طارئ
fr: Réparation d'urgence

source: Welcome to Rana Jayeen
ar: مرحبًا بكم في رنا جايين
fr: Bienvenue sur Rana Jayeen

# findMechanicsFast
source: Find trusted mechanics fast
ar: ابحث عن ميكانيكيين موثوقين بسرعة
fr: Trouvez des mécaniciens fiables rapidement

source: Create Post
ar: إنشاء منشور
fr: Créer une publication

# titleRequired
source: Title is required
ar: العنوان مطلوب
fr: Le titre est requis

# contentRequired
source: Content is required
ar: المحتوى مطلوب
fr: Le contenu est requis

# videoRequired
source: Video is required
ar: الفيديو مطلوب
fr: La vidéo est requise

# postCreated
source: Post created successfully
ar: تم إنشاء المنشور بنجاح
fr: Publication créée avec succès

# postCreateError
source: Failed to create post
ar: فشل في إنشاء المنشور
fr: Échec de la création de la publication

source: Upload Image
ar: رفع صورة
fr: Télécharger une image

source: Upload Video
ar: رفع فيديو
fr: Télécharger une vidéo

source: Video selected
ar: تم تحديد الفيديو
fr: Vidéo sélectionnée

# submit
source: Submit Report
ar: إرسال الطلب
fr: Soumettre le rapport

source: Rating
ar: التقييم
fr: Évaluation

# emergencyRepairMessage
source: Need urgent car repair? Find a mechanic now!
ar: هل تحتاج إلى إصلاح سيارة عاجل؟ ابحث عن ميكانيكي الآن!
fr: Besoin d'une réparation auto urgente ? Trouvez un mécanicien maintenant !

source: Search mechanics...
ar: ابحث عن الميكانيكيين...

source: Emergency Contacts
ar: جهات الاتصال في حالات الطوارئ
fr: Contacts d'urgence

# emergencyInfo
source: In case of emergency, don't hesitate to call immediately. Your safety is our priority.
ar: في حالة الطوارئ، لا تتردد في الاتصال فوراً. سلامتك أولويتنا.
fr: En cas d'urgence, n'hésitez pas à appeler immédiatement. Votre sécurité est notre priorité.

source: Emergency Numbers
ar: أرقام الطوارئ
fr: Numéros d'urgence

# emptyComment
source: Comment cannot be empty
ar: لا يمكن أن يكون التعليق فارغًا
fr: Le commentaire ne peut pas être vide

# empty_field_error
source: This field cannot be empty
ar: لا يمكن أن يكون هذا الحقل فارغًا
fr: Ce champ ne peut pas être vide

source: En Route:
ar: في الطريق:

# enable_notifications
source: Allow Notifications
ar: سماح بالاشعارات
fr: Autoriser les notifications

source: English
ar: الإنجليزية
fr: Anglais

# enterCodeSentTo
source: Enter the code sent to {phoneNumber}
ar: أدخل الرمز المرسل إلى {phoneNumber}
fr: Entrez le code envoyé à {phoneNumber}

# enterDescription
source: Enter a description (optional)
ar: أدخل وصفًا (اختياري)
fr: Entrez une description (facultatif)

# enterFeedback
source: Enter your feedback (optional)...
ar: أدخل تقييمك (اختياري)...
fr: Entrez votre commentaire (facultatif)...

source: Enter part name
ar: أدخل اسم القطعة
fr: Entrez le nom de la pièce

# enterText
source: Please enter text
ar: رجاءً أدخل النص
fr: Veuillez entrer du texte

# enterValidOtp
source: Please enter a valid 6-digit OTP
ar: الرجاء إدخال رمز OTP صحيح مكون من 6 أرقام
fr: Veuillez entrer un code OTP valide à 6 chiffres
