Repository: farah-Mimouni/Rana-jayeen
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Enter vehicle brand
ar: أدخل ماركة المركبة
fr: Entrez la marque du véhicule

source: Enter your name
ar: أدخل اسمك
fr: Entrez votre nom

source: Error
ar: خطأ
fr: Erreur

# errorAddress
source: Error getting address
ar: خطأ في الحصول على العنوان
fr: Erreur lors de l'obtention de l'adresse

source: Error loading services
ar: حدث خطأ أثناء تحميل الخدمات
fr: Erreur lors du chargement des services

# errorLocation
source: Error getting location
ar: خطأ في الحصول على الموقع
fr: Erreur lors de l'obtention de l'emplacement

# errorMessage
source: Something went wrong
ar: حدث خطأ ما
fr: Quelque chose s'est mal passé

# errorRequest
source: Failed to process your request
ar: فشل معالجة طلبك
fr: Échec du traitement de votre demande

# errorSendingOtp
source: Failed to send verification code: {error}
ar: فشل في إرسال رمز التحقق: {error}
fr: Échec de l'envoi du code de vérification : {error}

# errorUnexpected
source: Unexpected error
ar: خطأ غير متوقع
fr: Erreur inattendue

source: Error checking location permission
ar: خطأ في التحقق من إذن الموقع
fr: Erreur lors de la vérification de l'autorisation de localisation

source: Error fetching chats
ar: خطأ في جلب الدردشات
fr: Erreur lors de la récupération des chats

# error_fetching_driver_details
source: Failed to fetch provider details
ar: فشل في جلب تفاصيل المزود
fr: Échec de la récupération des détails du prestataire

# error_fetching_gas_stations
source: Failed to fetch gas stations
ar: فشل في جلب محطات الوقود
fr: Échec de la récupération des stations-service

# error_fetching_provider
source: Error fetching provider details
ar: خطأ في جلب تفاصيل مقدم الخدمة
fr: Erreur lors de la récupération des détails du prestataire

source: Error fetching stores
ar: خطأ في جلب المتاجر
fr: Erreur lors de la récupération des magasins

# error_location_denied
source: Location permission denied
ar: تم رفض إذن الموقع
fr: Autorisation de localisation refusée

# error_location_denied_forever
source: Location permission permanently denied
ar: تم رفض إذن الموقع بشكل دائم
fr: Autorisation de localisation refusée de manière permanente

# error_location_disabled
source: Location services disabled
ar: خدمة الموقع معطلة
fr: Services de localisation désactivés

# error_location_failed
source: Failed to retrieve location
ar: تعذر الحصول على الموقع
fr: Impossible de récupérer l'emplacement

# error_message_fetch_failed
source: Failed to fetch messages: %s
ar: فشل في جلب الرسائل: %s
fr: Échec de la récupération des messages : %s

# error_message_send_failed
source: Failed to send message: %s
ar: فشل في إرسال الرسالة: %s
fr: Échec de l'envoi du message : %s

# error_phone_call
source: Failed to make phone call
ar: فشل إجراء المكالمة
fr: Échec de l'appel téléphonique

# error_request_failed
source: Request submission failed: {error}
ar: فشل تقديم الطلب: {error}
fr: Échec de la soumission de la demande : {error}

# error_request_save
source: Failed to save request
ar: فشل في حفظ الطلب
fr: Échec de l'enregistrement de la demande

# error_request_status
source: Error listening to request status: {error}
ar: خطأ في متابعة حالة الطلب: {error}
fr: Erreur lors du suivi de l'état de la demande : {error}

# error_search_failed
source: Provider search failed: {error}
ar: فشل البحث عن مقدم الخدمة: {error}
fr: Échec de la recherche de prestataire : {error}

# error_tracking_request
source: Failed to track request
ar: فشل في تتبع الطلب
fr: Échec du suivi de la demande

# error_user_location
source: Failed to get user or location information
ar: فشل في الحصول على معلومات المستخدم أو الموقع
fr: Échec de l'obtention des informations de l'utilisateur ou de l'emplacement

source: Expand Search
ar: توسيع البحث
fr: Élargir la recherche

# expanding_search
source: Expanding search radius to
ar: توسيع نطاق البحث إلى
fr: Élargissement du rayon de recherche à

source: Exterior Wash
ar: غسيل خارجي
fr: Lavage extérieur

source: Exterior Wash
ar: غسيل خارجي
fr: Lavage extérieur

# failed_phone_call
source: Failed to make phone call
ar: فشل في إجراء مكالمة هاتفية
fr: Échec de l'appel téléphonique

source: Failed to book store
ar: فشل في حجز المتجر
fr: Échec de la réservation du magasin

source: Failed to cancel request.
ar: فشل في إلغاء الطلب.
fr: Échec de l'annulation de la demande.

# failed_to_create_request
source: Failed to create request. Retrying...
ar: فشل في إنشاء الطلب. جاري إعادة المحاولة...
fr: Échec de la création de la demande. Nouvelle tentative...

source: Failed to fetch driver details
ar: فشل في جلب تفاصيل السائق
fr: Échec de la récupération des détails du chauffeur

# failed_to_get_address
source: Failed to fetch address.
ar: فشل في جلب العنوان.
fr: Échec de la récupération de l'adresse.

source: Failed to get location
ar: فشل في الحصول على الموقع
fr: Échec de l'obtention de l'emplacement

# failed_to_initialize
source: Failed to initialize app
ar: فشل في تهيئة التطبيق
fr: Échec de l'initialisation de l'application

source: Failed to initialize provider search.
ar: فشل في تهيئة البحث عن مقدمي الخدمة.
fr: Échec de l'initialisation de la recherche de prestataires.

# failed_to_load_messages
source: Failed to load chat messages
ar: فشل في تحميل رسائل الدردشة
fr: Échec du chargement des messages de chat

source: Failed to load providers.
ar: فشل في تحميل مقدمي الخدمة.
fr: Échec du chargement des prestataires.

source: Failed to make call
ar: فشل في إجراء المكالمة
fr: Échec de l'appel

# failed_to_monitor_status
source: Failed to monitor request status
ar: فشل في مراقبة حالة الطلب
fr: Échec du suivi de l'état de la demande

source: Failed to notify provider
ar: فشل في إشعار مقدم الخدمة
fr: Échec de la notification du prestataire

source: Failed to open chat
ar: فشل في فتح الدردشة
fr: Échec de l'ouverture du chat

source: Failed to receive ride updates
ar: فشل في استقبال تحديثات الرحلة
fr: Échec de la réception des mises à jour de la course

source: Failed to restore state
ar: فشل في استعادة الحالة
fr: Échec de la restauration de l'état

# failed_to_search_providers
source: Failed to search for providers.
ar: فشل في البحث عن مقدمي الخدمة.
fr: Échec de la recherche de prestataires.

source: Failed to send notification
ar: فشل في إرسال الإشعار
fr: Échec de l'envoi de la notification

# failed_to_send_request
source: Failed to send request to provider.
ar: فشل في إرسال الطلب إلى مقدم الخدمة.
fr: Échec de l'envoi de la demande au prestataire.

source: Failed to start chat
ar: فشل في بدء الدردشة
fr: Échec du démarrage du chat

source: Failed to submit request
ar: فشل في إرسال الطلب
fr: Échec de la soumission de la demande

# failed_to_sync
source: Failed to sync data
ar: فشل في مزامنة البيانات
fr: Échec de la synchronisation des données

# failed_to_sync_driver_data
source: Failed to sync provider data
ar: فشل في مزامنة بيانات مقدم الخدمة
fr: Échec de la synchronisation des données du prestataire

source: Failed to update location
ar: فشل في تحديث الموقع
fr: Échec de la mise à jour de l'emplacement

# featureNotAvailable
source: Feature currently under development. We're working hard to make it available soon!
ar: ميزة قيد التطوير حالياً. نحن نعمل بجد لتوفيرها لك في أقرب وقت ممكن!
fr: Fonctionnalité en cours de développement. Nous travaillons dur pour la rendre disponible bientôt !

source: Featured Offer
ar: عرض مميز
fr: Offre en vedette

source: Features
ar: الميزات
fr: Caractéristiques

source: Feedback
ar: التقييم
fr: Commentaires

# feedbackSuccess
source: Your feedback was sent successfully. Thank you for your input!
ar: تم إرسال تقييمك بنجاح. شكرًا لرأيك!
fr: Votre commentaire a été envoyé avec succès. Merci pour votre contribution !

source: Fetching location...
ar: جاري جلب الموقع...
fr: Récupération de l'emplacement...

source: Find Your Ride
ar: ابحث عن سيارتك
fr: Trouver votre course

source: Finding Provider
ar: البحث عن مقدم خدمة
fr: Recherche de prestataire

source: First Name
ar: الاسم الأول
fr: Prénom

source: Forgot Password?
ar: نسيت كلمة المرور؟
fr: Mot de passe oublié ?

source: Free Diagnostic
ar: تشخيص مجاني
fr: Diagnostic gratuit

# freeDiagnosticDesc
source: Get a free car diagnostic this week only!
ar: احصل على تشخيص مجاني لسيارتك هذا الأسبوع فقط!
fr: Obtenez un diagnostic gratuit pour votre voiture cette semaine uniquement !

source: French
ar: الفرنسية
fr: Français

source: Full Name
ar: الاسم الكامل
fr: Nom complet

# fullNameOptional
source: Full Name
ar: الاسم الكامل
fr: Nom complet

# fullRepairTitle
source: Full Repair
ar: إصلاح كامل
fr: Réparation complète

# fullRepairType
source: Comprehensive Repair
ar: تصليح شامل
fr: Réparation complète

source: Full Wash
ar: غسيل كامل
fr: Lavage complet

source: Full Wash
ar: غسيل كامل
fr: Lavage complet

source: Gas Station
ar: محطة وقود
fr: Station-service

# gasStationDescription
source: Fuel and convenience services
ar: خدمات الوقود والتسهيلات
fr: Services de carburant et commodités

# gasStationTitle
source: Gas Station
ar: محطة وقود
fr: Station-service

source: Gas station selected
ar: تم اختيار محطة الوقود
fr: Station-service sélectionnée

# gendarmerie
source: National Gendarmerie
ar: الدرك الوطني
fr: Gendarmerie nationale

# gendarmerieDescription
source: Your safety matters. In case of an emergency, you can call directly or send an alert or message with your location.
ar: يهمنا سلامتك. فور حدوث أي طارئ، يمكنك الاتصال مباشرة أو إرسال تنبيه أو رسالة مع موقع تواجدك.
fr: Votre sécurité compte. En cas d'urgence, vous pouvez appeler directement ou envoyer une alerte ou un message avec votre position.

# geoFireError
source: Error initializing GeoFire.
ar: خطأ في تهيئة GeoFire.
fr: Erreur d'initialisation de GeoFire.

# glassRepairDescription
source: Windshield and glass repair services
ar: خدمات إصلاح الزجاج الأمامي والزجاج
fr: Services de réparation de pare-brise et de vitres

# glassRepairTitle
source: Glass Repair
ar: إصلاح الزجاج
fr: Réparation de vitres

source: Go Back
ar: العودة
fr: Retourner

# goingToDestination
source: On the way to destination - Arrival time:
ar: في الطريق إلى الوجهة - وقت الوصول:
fr: En route vers la destination - Heure d'arrivée :

source: Guest
ar: ضيف
fr: Invité

# guides
source: Guide
ar: مقالة

source: Help
ar: المساعدة
fr: Aide

# helpDescription
source: Looks like you're having an issue. We're here to help! Feel free to reach out via message or call.
ar: يبدو أنك تواجه مشكلة. نحن هنا لمساعدتك! لا تتردد في التواصل معنا عبر إرسال رسالة أو الاتصال بنا.
fr: Il semble que vous rencontriez un problème. Nous sommes là pour vous aider ! N'hésitez pas à nous contacter par message ou appel.

source: Help Text
ar: نص المساعدة
fr: Texte d'aide

source: Hide Stores
ar: إخفاء المتاجر
fr: Masquer les magasins

source: Highest Rated
ar: الأعلى تقييمًا
fr: Les mieux notés

source: Home
ar: الرئيسية
fr: Accueil

# hours_ago
source: {count, plural, zero{0 hours ago} one{1 hour ago} other{{count} hours ago}}
ar: {count, plural, zero{قبل 0 ساعات} one{قبل ساعة واحدة} other{قبل {count} ساعات}}
fr: {count, plural, zero{il y a 0 heure} one{il y a 1 heure} other{il y a {count} heures}}

# howCanWeHelp
source: How Can We Help You?
ar: كيف يمكننا مساعدتك؟
fr: Comment pouvons-nous vous aider ?

source: In Progress
ar: جاري
fr: En cours

source: Info
ar: معلومات

source: Initializing service...
ar: جارٍ تهيئة الخدمة...
fr: Initialisation du service...

source: Interior Wash
ar: غسيل داخلي
fr: Lavage intérieur

source: Interior Wash
ar: غسيل داخلي
fr: Lavage intérieur

# invalidOtp
source: Invalid verification code
ar: رمز التحقق غير صالح
fr: Code de vérification invalide

source: Invalid service type
ar: نوع الخدمة غير صالح
fr: Type de service invalide

# inviteFriend
source: Invite a Friend
ar: دعوة صديق
fr: Inviter un ami

source: Job
ar: الوظيفة
fr: Emploi

source: Just Now
ar: الآن
fr: À l'instant

# keyProgrammingDescription
source: On-site car key programming or replacement
ar: برمجة أو استبدال مفاتيح السيارة في الموقع
fr: Programmation ou remplacement de clés de voiture sur place

# keyProgrammingTitle
source: Key Programming
ar: برمجة مفاتيح السيارة
fr: Programmation de clés

source: km
ar: كم

# languageChanged
source: Language changed successfully
ar: تم تغيير اللغة بنجاح
fr: Langue changée avec succès

# lat
source: Latitude
ar: خط العرض

source: Learn More
ar: تعرف على المزيد
fr: En savoir plus

source: Like
ar: إعجاب
fr: Aimer

# likeError
source: Error updating like status
ar: حدث خطأ أثناء تحديث حالة الإعجاب
fr: Erreur lors de la mise à jour du statut d'aimé

# liked
source: Liked successfully
ar: تم الإعجاب بنجاح
fr: Aimé avec succès

# lng
source: Longitude
ar: خط الطول

source: Loading...
ar: جاري التحميل...
fr: Chargement...

source: Loading address...
ar: جارٍ تحميل العنوان...
fr: Chargement de l'adresse...

# loadingCarFixesTips
source: Loading car fixes and tips...
ar: جارٍ تحميل إصلاحات السيارات والنصائح...
fr: Chargement des réparations et conseils automobiles...

source: Loading posts...
ar: جاري تحميل المنشورات...
fr: Chargement des publications...

source: Loading tutorials...
ar: جارٍ تحميل الدروس...
fr: Chargement des tutoriels...

source: Loading address...
ar: جاري تحميل العنوان...
fr: Chargement de l'adresse...

source: Locating...
ar: جارٍ تحديد الموقع...
fr: Localisation...

source: Location
ar: الموقع
fr: Emplacement

# locationDisabled
source: Location services are disabled. Please enable them to view providers.
ar: خدمات الموقع معطلة. يرجى تفعيلها لعرض مقدم الخدمةين.
fr: Les services de localisation sont désactivés. Veuillez les activer pour voir les prestataires.

# locationError
source: Location information unavailable.
ar: معلومات الموقع غير متوفرة.
fr: Informations de localisation indisponibles.

# locationFetchError
source: Failed to fetch location.
ar: فشل في الحصول على الموقع.
fr: Échec de la récupération de l'emplacement.

# locationFetchFailed
source: Failed to locate, please try again
ar: فشل في تحديد الموقع، حاول مرة أخرى
fr: Échec de la localisation, veuillez réessayer

# locationPermission
source: Please enable location permission
ar: يرجى تفعيل إذن الموقع
fr: Veuillez activer l'autorisation de localisation

# locationPermissionDenied
source: Location permission must be granted.
ar: يجب منح إذن الموقع.
fr: L'autorisation de localisation doit être accordée.

# locationPermissionDeniedForever
source: Location permission permanently denied. Please enable it in settings.
ar: تم رفض إذن الموقع بشكل دائم. يرجى تفعيله في الإعدادات.
fr: Autorisation de localisation refusée de manière permanente. Veuillez l'activer dans les paramètres.

# locationPermissionError
source: Error checking location permission.
ar: خطأ في التحقق من إذن الموقع.
fr: Erreur lors de la vérification de l'autorisation de localisation.

source: Location permission permanently denied.
ar: تم رفض إذن الموقع بشكل دائم.
fr: Autorisation de localisation refusée de manière permanente.

# locationPermissionRequired
source: Location permission required to use the service
ar: مطلوب إذن الموقع لاستخدام الخدمة
fr: Autorisation de localisation requise pour utiliser le service

# locationServiceDisabled
source: Location services disabled. Please enable them.
ar: خدمات الموقع معطلة. يرجى تفعيلها.
fr: Services de localisation désactivés. Veuillez les activer.

# locationServicesDisabled
source: Location services are disabled. Please enable them.
ar: خدمات الموقع معطلة. يرجى تفعيلها.
fr: Les services de localisation sont désactivés. Veuillez les activer.

# location_denied
source: Location permission denied. Please allow access.
ar: تم رفض إذن الموقع. يرجى السماح بالوصول.
fr: Autorisation de localisation refusée. Veuillez autoriser l'accès.

# location_denied_forever
source: Location permission permanently denied. Please enable it in settings.
ar: تم رفض إذن الموقع بشكل دائم. يرجى تفعيله في الإعدادات.
fr: Autorisation de localisation refusée de manière permanente. Veuillez l'activer dans les paramètres.

# location_disabled
source: Location services disabled. Please enable them.
ar: خدمات الموقع معطلة. يرجى تفعيلها.
fr: Services de localisation désactivés. Veuillez les activer.

# location_error
source: Error fetching location. Please try again.
ar: خطأ في جلب الموقع. يرجى المحاولة مرة أخرى.
fr: Erreur lors de la récupération de l'emplacement. Veuillez réessayer.

# location_fetch_failed
source: Failed to fetch location
ar: فشل في الحصول على الموقع
fr: Échec de la récupération de l'emplacement

source: Location permission denied.
ar: تم رفض إذن الموقع.
fr: Autorisation de localisation refusée.

# location_permission_denied_forever
source: Location permission permanently denied.
ar: تم رفض إذن الموقع بشكل دائم.
fr: Autorisation de localisation refusée de manière permanente.

# location_permission_denied_permanently
source: Location permission permanently denied
ar: تم رفض إذن الموقع بشكل دائم
fr: Autorisation de localisation refusée de manière permanente

source: Location permission error
ar: خطأ في إذن الموقع
fr: Erreur d'autorisation de localisation

source: Location permission required
ar: إذن الموقع مطلوب
fr: Autorisation de localisation requise

source: Location Selection
ar: اختيار الموقع
fr: Sélection de l'emplacement

# location_service_disabled
source: Location services disabled
ar: خدمات الموقع معطلة
fr: Services de localisation désactivés

# location_services_disabled
source: Please enable location services.
ar: يرجى تفعيل خدمات الموقع.
fr: Veuillez activer les services de localisation.

source: Login
ar: تسجيل الدخول
fr: Connexion

# loginRequired
source: Please log in to subscribe
ar: يرجى تسجيل الدخول للاشتراك
fr: Veuillez vous connecter pour vous abonner

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

# logoutError
source: Error logging out: @error
ar: خطأ في تسجيل الخروج: @error
fr: Erreur lors de la déconnexion : @error

source: Luxury
ar: فاخرة
fr: Luxe

# maintenanceCategory
source: Maintenance
ar: الصيانة
fr: Entretien

source: Map
ar: خريطة
fr: Carte

# message
source: send message
ar: ارسال رسالة
fr: message

# mapThemeError
source: Failed to load map theme.
ar: فشل في تحميل نمط الخريطة.
fr: Échec du chargement du thème de la carte.

# map_label
source: Map showing your location and nearby providers
ar: خريطة تُظهر موقعك ومقدمي الخدمة القريبين
fr: Carte montrant votre emplacement et les prestataires à proximité

# max_retries_reached
source: Maximum retry attempts reached for search.
ar: تم الوصول إلى الحد الأقصى للمحاولات للبحث.
fr: Nombre maximum de tentatives atteint pour la recherche.

source: Mechanic Services
ar: خدمات الميكانيكي
fr: Services de mécanique

source: Menu
ar: القائمة

# messageComingSoon
source: The messaging feature is currently under development and will be available soon. Thank you for your patience!
ar: ميزة المراسلة قيد التطوير حالياً وسوف تكون متاحة قريباً. شكراً لصبركم!
fr: La fonctionnalité de messagerie est actuellement en cours de développement et sera disponible bientôt. Merci de votre patience !

source: Message Sent
ar: تم إرسال الرسالة
fr: Message envoyé

# messageSuccess
source: Your message was sent successfully. We'll reach out soon.
ar: تم إرسال رسالتك بنجاح. سيتم التواصل معك قريبًا.
fr: Votre message a été envoyé avec succès. Nous vous contacterons bientôt.

# minutes_ago
source: {count, plural, zero{0 minutes ago} one{1 minute ago} other{{count} minutes ago}}
ar: {count, plural, zero{قبل 0 دقائق} one{قبل دقيقة واحدة} other{قبل {count} دقائق}}
fr: {count, plural, zero{il y a 0 minute} one{il y a 1 minute} other{il y a {count} minutes}}

# mobile_car_wash
source: Mobile
ar: غسيل متنقل

source: Mobile Car Wash Provider
ar: مقدم خدمة غسيل سيارات متنقل
fr: Prestataire de lavage de voiture mobile

# more_info_hint
source: Add more information
ar: أضف المزيد من المعلومات
fr: Ajouter plus d'informations

source: Motorcycle
ar: دراجة نارية
fr: Moto

source: Motorcycles
ar: الدراجات النارية
fr: Motos

source: Name
ar: الاسم
fr: Nom

source: Nearby Gas Stations
ar: محطات الوقود القريبة
fr: Stations-service à proximité

# new_message_body
source: New message from
ar: رسالة جديدة من
fr: Nouveau message de

# new_message_title
source: New Message
ar: رسالة جديدة
fr: Nouveau message

# new_request_at
source: New
ar: جديد
fr: Nouveau

source: Next
ar: التالي
fr: Suivant

source: No
ar: لا
fr: Non

# noAddressFound
source: No address found for this location
ar: لا يوجد عنوان لهذا الموقع
fr: Aucune adresse trouvée pour cet emplacement

# noCarFixesTips
source: No content available for this category.
ar: لا يوجد محتوى متاح لهذه الفئة.
fr: Aucun contenu disponible pour cette catégorie.

# noDriversAvailable
source: No providers available
ar: لا يوجد مزودي خدمة متاحين
fr: Aucun prestataire disponible

# invalidPhoneNumber
source: Invalid phone number. Please check and try again.
ar: رقم الهاتف غير صالح. يرجى التحقق وإعادة المحاولة.
fr: Numéro de téléphone invalide. Veuillez vérifier et réessayer.

# tooManyRequests
source: Too many requests. Please wait before trying again.
ar: طلبات كثيرة جدًا. يرجى الانتظار قبل المحاولة مرة أخرى.
fr: Trop de requêtes. Veuillez attendre avant de réessayer.

# otpExpired
source: The verification code has expired. Please request a new one.
ar: انتهت صلاحية رمز التحقق. يرجى طلب رمز جديد.
fr: Le code de vérification a expiré. Veuillez en demander un nouveau.

source: No internet connection
ar: لا يوجد اتصال بالإنترنت
fr: Pas de connexion Internet

# noMatchingDriver
source: No matching driver found
ar: لم يتم العثور على سائق مطابق
fr: Aucun chauffeur correspondant trouvé

# noMatchingProvider
source: No matching provider found.
ar: لم يتم العثور على مزود مطابق.
fr: Aucun prestataire correspondant trouvé.

# noPhone
source: No phone number
ar: لا يوجد رقم هاتف
fr: Aucun numéro de téléphone

source: Rating Submitted
ar: تم تقديم التقييم
fr: Évaluation Soumise

# rating_queued
source: Rating queued, will sync when online
ar: تمت إضافة التقييم إلى قائمة الانتظار، سيتم المزامنة عند الاتصال بالإنترنت
fr: Évaluation mise en attente, sera synchronisée en ligne

source: No ratings
ar: لا تقييمات بعد
fr: Aucune étoile

source: Failed to submit rating
ar: فشل في إرسال التقييم
fr: Échec de la soumission de l'évaluation

# noInternetConnectionWithCache
source: No internet connection. Use offline mode with last saved data or try again when connected.
ar: لا يوجد اتصال بالإنترنت. استخدم الوضع غير المتصل بالبيانات المحفوظة سابقًا أو حاول مرة أخرى عند الاتصال.
fr: Pas de connexion Internet. Utilisez le mode hors ligne avec les dernières données enregistrées ou réessayez lorsque vous êtes connecté.

source: Use Offline
ar: استخدام وضع عدم متصل
fr: Utiliser hors ligne

# checkingNetwork
source: Checking network connection...
ar: جارٍ التحقق من الاتصال بالشبكة...
fr: Vérification de la connexion réseau...

source: Loading cached data...
ar: جارٍ تحميل البيانات المحفوظة...
fr: Chargement des données en cache...

# dataSynced
source: Your data has been updated.
ar: تم تحديث بياناتك.
fr: Vos données ont été mises à jour.

# syncFailed
source: Failed to update data. Please try again later.
ar: فشل تحديث البيانات. يرجى المحاولة مرة أخرى لاحقًا.
fr: Échec de la mise à jour des données. Veuillez réessayer plus tard.

# noPosts
source: No posts available
ar: لا توجد منشورات متاحة
fr: Aucune publication disponible

# noProviderAvailable
source: No provider available at the moment
ar: لا يوجد مزود خدمة متاح حالياً
fr: Aucun prestataire disponible pour le moment

# noProvidersAvailable
source: No providers available at the moment
ar: لا يوجد مزود خدمة متاح حالياً
fr: Aucun prestataire disponible pour le moment

# noProvidersNearby
source: No providers available nearby.
ar: لا يوجد مزودين متاحين بالقرب.
fr: Aucun prestataire disponible à proximité.

source: No services found
ar: لم يتم العثور على خدمات
fr: Aucun service trouvé

# noTutorials
source: No tutorials available for this category.
ar: لا توجد دروس متاحة لهذه الفئة.
fr: Aucun tutoriel disponible pour cette catégorie.

# noVehicles
source: No vehicles found
ar: لم يتم العثور على سيارات
fr: Aucun véhicule trouvé
