Repository: farah-Mimouni/Rana-jayeen
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Unsubscribe
ar: إلغاء الاشتراك
fr: Se désabonner

# unsubscribed
source: Unsubscribed successfully
ar: تم إلغاء الاشتراك بنجاح
fr: Désabonnement réussi

# upload_failed
source: Failed to upload image
ar: فشل في رفع الصورة
fr: Échec du téléchargement de l'image

source: Urgent
ar: عاجل

source: Urgent Request
ar: طلب عاجل
fr: Demande urgente

# urlError
source: Unable to open content. Please try again.
ar: غير قادر على فتح المحتوى. يرجى المحاولة مرة أخرى.
fr: Impossible d'ouvrir le contenu. Veuillez réessayer.

# user1
source: John Doe
ar: جون دو
fr: Jean Dupont

# user2
source: Jane Smith
ar: جين سميث
fr: Jeanne Martin

# userInfoError
source: Failed to get user information.
ar: فشل في الحصول على معلومات المستخدم.
fr: Échec de l'obtention des informations de l'utilisateur.

# userLocationFetchFailed
source: Failed to fetch user or location data
ar: فشل في جلب بيانات المستخدم أو الموقع
fr: Échec de la récupération des données de l'utilisateur ou de l'emplacement

source: Username
ar: اسم المستخدم
fr: Nom d'utilisateur

source: Vehicle
ar: السيارة
fr: Véhicule

source: Vehicle Brand
ar: ماركة السيارة
fr: Marque du véhicule

# vehicleBrandError
source: Please enter vehicle brand
ar: يرجى إدخال ماركة السيارة
fr: Veuillez entrer la marque du véhicule

source: Vehicle Type
ar: نوع المركبة
fr: Type de véhicule

# vehicleTypeError
source: Please select a vehicle type
ar: يرجى اختيار نوع المركبة
fr: Veuillez sélectionner un type de véhicule

# verificationCode
source: OTP
ar: رمز التحقق

# verificationFailed
source: Verification failed: {error}
ar: فشل التحقق: {error}
fr: Échec de la vérification : {error}

source: Videos
ar: فيديوهات
fr: Vidéos

source: View All
ar: عرض الكل
fr: Voir tout

# views
source: {count, plural, zero{0 views} one{1 view} other{{count} views}}
ar: {count, plural, zero{0 مشاهدات} one{مشاهدة واحدة} other{{count} مشاهدات}}
fr: {count, plural, zero{0 vue} one{1 vue} other{{count} vues}}

source: Waiting
ar: في انتظار
fr: En attente

# waiting_for_confirmation
source: Your request has been sent, please wait for provider confirmation
ar: تم إرسال طلبك، يرجى الانتظار لتأكيد مقدم الخدمة
fr: Votre demande a été envoyée, veuillez attendre la confirmation du prestataire

source: Wash Type
ar: نوع الغسيل
fr: Type de lavage

# washTypeError
source: Please select a wash type
ar: يرجى اختيار نوع الغسيل
fr: Veuillez sélectionner un type de lavage

source: Wash Type
ar: نوع الغسيل
fr: Type de lavage

# wash_type_error
source: Please select a wash type
ar: يرجى تحديد نوع الغسيل
fr: Veuillez sélectionner un type de lavage

source: We Are Coming
ar: رانا جايين
fr: Nous Arrivons

source: We Are Here to Help
ar: نحن هنا للمساعدة
fr: Nous sommes là pour aider

source: Welcome
ar: مرحباً
fr: Bienvenue

# wheelChangeDescription
source: On-site tire repair or replacement
ar: إصلاح أو استبدال الإطارات في موقعك
fr: Réparation ou remplacement de pneus sur place

# wheelChangeTitle
source: Tire Change or Repair
ar: تغيير أو إصلاح الإطارات
fr: Changement ou réparation de pneus

# wheelChangeType
source: Wheel Change
ar: تغيير عجلات
fr: Changement de roues

source: Who We Are
ar: من نحن
fr: Qui nous sommes

# willContact
source: We'll contact you soon with service details
ar: سنتصل بك قريبًا بتفاصيل الخدمة
fr: Nous vous contacterons bientôt avec les détails du service

source: With Driver
ar: مع سائق
fr: Avec chauffeur

source: Write Here
ar: اكتب هنا
fr: Écrire ici

source: Year
ar: السنة
fr: Année

source: Yes
ar: نعم
fr: Oui

source: your location
ar: موقعك الحالي
fr: Votre localisation

# yourOpinionMatters
source: Your opinion matters, so feel free to share.
ar: رأيك يهمنا لذا عبر بكل راحة.
fr: Votre avis compte, alors n'hésitez pas à partager.

source: Your Location
ar: موقعك
fr: Votre emplacement

source: Zoom In
ar: تكبير
fr: Zoomer

source: Zoom Out
ar: تصغير
fr: Dézoomer

# view_providers
source: View Cached Providers
ar: عرض المزودين المخزنين
fr: Voir les prestataires mis en cache

source: Cached Providers
ar: المزودين المخزنين
fr: Prestataires mis en cache

# offline_request_not_allowed
source: Cannot send request in offline mode. View cached providers instead.
ar: لا يمكن إرسال الطلب في الوضع غير المتصل. عرض المزودين المخزنين بدلاً من ذلك.
fr: Impossible d'envoyer une demande en mode hors ligne. Voir les prestataires mis en cache à la place.

source: No cached providers available.
ar: لا توجد مزودات مخزنة متاحة.
fr: Aucun prestataire mis en cache disponible.

# greetingPersonal
source: Hi {userName}
ar: مرحبًا {userName}
fr: Bonjour {userName}

# quotaExceededError
source: Too many OTP requests. Try again later or use another method.
ar: طلبات OTP كثيرة جدًا. حاول لاحقًا أو استخدم طريقة أخرى.
fr: Trop de demandes d'OTP. Réessayez plus tard ou utilisez une autre méthode.

# greetingAvailability
source: Wherever you are,we are
ar: وين ما كنتو رانا كاينين
fr: Où que vous soyez,nous sommes là

# greetingSupport
source: Support us to grow and expand
ar: ادعمنا لنتطور و نتوسع اكثر
fr: Ensemble, allons plus loin

# marketingSlogan
source: Break down anywhere? Rana Jayeen brings help to you fast.
ar: تعطلت في أي مكان؟ رنا جايين تجلب المساعدة بسرعة.
fr: En panne n'importe où ? Rana Jayeen vous apporte de l'aide rapidement.

source: Trip Ended
ar: انتهت الرحلة
fr: Trajet Terminé

# trip_ended_message
source: Your trip has concluded. Please rate the service.
ar: لقد انتهت رحلتك. يرجى تقييم الخدمة.
fr: Votre trajet est terminé. Veuillez évaluer le service.

source: Rate Service
ar: تقييم الخدمة
fr: Évaluer le Service

source: Comments (Optional)
ar: التعليقات (اختيارية)
fr: Commentaires (Facultatif)

# enter_comments
source: Enter your comments here
ar: أدخل تعليقاتك هنا
fr: Entrez vos commentaires ici

# rating_submitted_message
source: Thank you for your feedback!
ar: شكرًا على ملاحظاتك!
fr: Merci pour vos commentaires !

# error_submitting_rating
source: Failed to submit rating. Please try again.
ar: فشل في تقديم التقييم. حاول مرة أخرى.
fr: Échec de la soumission de l'évaluation. Veuillez réessayer.

source: Chat Synced
ar: تم مزامنة الدردشة
fr: Chat Synchronisé

# chat_synced_message
source: Your chat has been successfully synced.
ar: تمت مزامنة الدردشة بنجاح.
fr: Votre chat a été synchronisé avec succès.

source: Trip Cancelled
ar: تم إلغاء الرحلة
fr: Trajet Annulé

# trip_cancelled_message
source: Your trip has been cancelled.
ar: لقد تم إلغاء رحلتك.
fr: Votre trajet a été annulé.

source: Call Initiated
ar: تم بدء المكالمة
fr: Appel Initié

# call_initiated_message
source: Connecting you to the provider.
ar: جارٍ الاتصال بالمزود.
fr: Connexion au prestataire.

# error_invalid_coordinates
source: Invalid coordinates provided
ar: الإحداثيات المقدمة غير صالحة
fr: Coordonnées invalides fournies

# error_api_key_missing
source: API key is missing
ar: مفتاح واجهة برمجة التطبيقات غير موجود
fr: Clé API manquante

# error_fetching_directions
source: Failed to fetch directions
ar: فشل في جلب الاتجاهات
fr: Échec de la récupération des itinéraires
