Repository: farah-Mimouni/Rana-jayeen
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# no_address
source: No address provided
ar: لا يوجد عنوان مقدم
fr: Aucune adresse fournie

# no_cached_providers
source: No cached providers found for this service.
ar: لم يتم العثور على مقدمي خدمة مخزنين لهذه الخدمة.
fr: Aucun prestataire mis en cache trouvé pour ce service.

source: No chats available
ar: لا توجد دردشات متاحة
fr: Aucun chat disponible

# no_driver_assigned
source: No driver assigned yet
ar: لم يتم تعيين سائق بعد
fr: Aucun chauffeur assigné pour l'instant

# no_drivers_available
source: No providers available near you
ar: لا يوجد مزودو خدمات متاحون بالقرب منك
fr: Aucun prestataire disponible près de vous

source: No gas stations available
ar: لا توجد محطات وقود متاحة
fr: Aucune station-service disponible

source: No provider found
ar: لم يتم العثور على مقدم خدمة
fr: Aucun prestataire trouvé

source: No providers available
ar: لا يوجد مقدمو خدمة متاحون
fr: Aucun prestataire disponible

# no_providers_available_offline
source: No providers available in offline mode
ar: لا يوجد مقدمو خدمة متاحون في وضع عدم الاتصال
fr: Aucun prestataire disponible en mode hors ligne

# no_providers_for
source: No providers available for
ar: لا يوجد مزودون متاحون لـ
fr: Aucun prestataire disponible pour

# no_providers_found
source: No providers found after maximum retries.
ar: لم يتم العثور على مقدمي خدمة بعد الحد الأقصى للمحاولات.
fr: Aucun prestataire trouvé après le maximum de tentatives.

# no_providers_found_searching
source: No providers found. Continuing search...
ar: لم يتم العثور على مقدمي خدمة. مواصلة البحث...
fr: Aucun prestataire trouvé. Poursuite de la recherche...

# no_results_found
source: No results found for search
ar: لم يتم العثور على نتائج للبحث
fr: Aucun résultat trouvé pour la recherche

# no_stores_available
source: No stores available for this service
ar: لا توجد متاجر متاحة لهذه الخدمة
fr: Aucun magasin disponible pour ce service

source: Not Available
ar: غير متوفر
fr: Non disponible

source: Not Specified
ar: غير محدد
fr: Non spécifié

# notificationSent
source: Notification sent to nearby providers
ar: تم إرسال الإشعار إلى مزودي الخدمة القريبين
fr: Notification envoyée aux prestataires à proximité

# notification_failed
source: Failed to send notification to provider
ar: فشل في إرسال الإشعار إلى مقدم الخدمة
fr: Échec de l'envoi de la notification au prestataire

# notification_next_provider
source: Searching for another provider
ar: البحث عن مقدم خدمة آخر
fr: Recherche d'un autre prestataire

# notification_sent_success
source: Contacting provider
ar: جارٍ التواصل مع مقدم الخدمة
fr: Contacter le prestataire

source: Notification unavailable.
ar: الإشعار غير متاح.
fr: Notification non disponible.

# notifications_title
source: Notifications
ar: الإبلاغات

source: Offline Mode
ar: وضع عدم الاتصال
fr: Mode hors ligne

# offline_providers_available
source: Available Providers (Offline)
ar: مقدمو الخدمة المتاحون (غير متصل)
fr: Prestataires disponibles (hors ligne)

source: Oil Change
ar: تغيير الزيت
fr: Vidange d'huile

source: OK
ar: موافق

source: Or
ar: أو
fr: Ou

# originAddress
source: Location Address
ar: عنوان الموقع
fr: Adresse de l'emplacement

# otpRequestTooSoon
source: Please wait before requesting another OTP
ar: الرجاء الانتظار قبل طلب رمز OTP آخر
fr: Veuillez attendre avant de demander un autre code OTP

# otpSendFailed
source: Failed to send OTP
ar: فشل إرسال رمز OTP
fr: Échec de l'envoi du code OTP

source: OTP sent successfully
ar: تم إرسال رمز OTP بنجاح
fr: Code OTP envoyé avec succès

source: OTP verification failed
ar: فشل التحقق من رمز OTP
fr: Échec de la vérification du code OTP

source: Part Name
ar: اسم الجزء
fr: Nom de la pièce

# partNameError
source: Please enter part name
ar: يرجى إدخال اسم الجزء
fr: Veuillez entrer le nom de la pièce

source: Password
ar: كلمة المرور
fr: Mot de passe

source: Phone
ar: الهاتف
fr: Téléphone

# phoneNotAvailable
source: Phone number not available
ar: رقم الهاتف غير متاح
fr: Numéro de téléphone non disponible

source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

# phoneVerifiedMessage
source: Your phone number has been verified successfully.
ar: تم التحقق من رقم هاتفك بنجاح.
fr: Votre numéro de téléphone a été vérifié avec succès.

source: Phone verified successfully
ar: تم التحقق من الهاتف بنجاح
fr: Téléphone vérifié avec succès

# phone_not_available
source: Phone number not available
ar: رقم الهاتف غير متاح
fr: Numéro de téléphone non disponible

source: Pickup Date
ar: تاريخ الاستلام
fr: Date de prise en charge

# pleaseEnterName
source: Please enter your name
ar: الرجاء إدخال اسمك
fr: Veuillez entrer votre nom

# pleaseEnterValidPhone
source: Please enter a valid phone number
ar: الرجاء إدخال رقم هاتف صحيح
fr: Veuillez entrer un numéro de téléphone valide

# pleaseSelectRating
source: Please select a rating before submitting.
ar: يرجى اختيار تقييم قبل الإرسال.
fr: Veuillez sélectionner une note avant de soumettre.

# pleaseWait
source: Please wait a moment
ar: يرجى الانتظار قليلاً
fr: Veuillez patienter un instant

source: Police
ar: الشرطة

# policeDescription
source: Your safety matters. In case of an emergency, you can call directly or send an alert or message with your location.
ar: يهمنا سلامتك. فور حدوث أي طارئ، يمكنك الاتصال مباشرة أو إرسال تنبيه أو رسالة مع موقع تواجدك.
fr: Votre sécurité compte. En cas d'urgence, vous pouvez appeler directement ou envoyer une alerte ou un message avec votre position.

# popularProducts
source: Our Core Services
ar: الخدمات الأساسية
fr: Nos services principaux

# popularServices
source: Our Core Services
ar: الخدمات الاساسية
fr: Nos services principaux

# postDeleteError
source: Error deleting post
ar: حدث خطأ أثناء حذف المنشور
fr: Erreur lors de la suppression de la publication

# postDeleted
source: Post deleted successfully
ar: تم حذف المنشور بنجاح
fr: Publication supprimée avec succès

# postUpdateError
source: Error updating post
ar: حدث خطأ أثناء تحديث المنشور
fr: Erreur lors de la mise à jour de la publication

# nearby_stores
source: Nearby {serviceTitle}
ar: {serviceTitle} القريبة

# postUpdated
source: Post updated successfully
ar: تم تحديث المنشور بنجاح
fr: Publication mise à jour avec succès

# pothole_report_category
source: Pothole
ar: حفرة
fr: Nid-de-poule

# pothole_report_description
source: Report a pothole to improve road safety
ar: الإبلاغ عن حفرة لتحسين سلامة الطرق
fr: Signaler un nid-de-poule pour améliorer la sécurité routière

source: Powerful Truck
ar: شاحنة قوية
fr: Camion puissant

source: Price: High to Low
ar: السعر: من الأعلى إلى الأقل
fr: Prix : du plus élevé au plus bas

source: Price: Low to High
ar: السعر: من الأقل إلى الأعلى
fr: Prix : du plus bas au plus élevé

# pricePerDay
source: Daily Price
ar: السعر اليومي
fr: Prix journalier

source: Primary Services
ar: الخدمات الأساسية
fr: Services principaux

source: Profile
ar: الملف الشخصي
fr: Profil

source: Promotions
ar: العروض الترويجية

source: Provider
ar: مقدم الخدمة
fr: Prestataire

source: Provider Arrived
ar: وصل مقدم الخدمة
fr: Prestataire arrivé

# providerOnWay
source: Provider on the Way
ar: مقدم الخدمة في طريقه
fr: Prestataire en route

source: Provider Assigned
ar: تم تعيين مقدم الخدمة
fr: Prestataire assigné

# provider_assigned_body
source: Provider
ar: مقدم الخدمة
fr: Prestataire

# provider_declined
source: Providers declined the request. Trying other providers...
ar: رفض مزودو الخدمة الطلب. جارٍ المحاولة مع مزودين آخرين...
fr: Les prestataires ont refusé la demande. Essai avec d'autres prestataires...

source: Provider Details
ar: تفاصيل مقدم الخدمة
fr: Détails du prestataire

source: Provider Location
ar: موقع مقدم الخدمة
fr: Emplacement du prestataire

# provider_no_service
source: Provider does not offer this service
ar: مقدم الخدمة لا يقدم هذه الخدمة
fr: Le prestataire n'offre pas ce service

# provider_not_found
source: Provider not found in cached data
ar: لم يتم العثور على مقدم الخدمة في البيانات المخزنة
fr: Prestataire non trouvé dans les données mises en cache

# provider_notification_unavailable
source: Provider
ar: مقدم الخدمة
fr: Prestataire

# provider_on_way
source: Provider on the way
ar: مقدم الخدمة في الطريق
fr: Prestataire en route

# provider_timeout
source: Providers did not respond. Trying other providers...
ar: لم يستجب مزودو الخدمة. جارٍ المحاولة مع مزودين آخرين...
fr: Les prestataires n'ont pas répondu. Essai avec d'autres prestataires...

source: Providers
ar: مقدمي الخدمة
fr: Prestataires

# providers_declined
source: Providers declined. Trying other providers...
ar: رفض مقدمو الخدمة. جاري المحاولة مع مقدمين آخرين...
fr: Les prestataires ont refusé. Essai avec d'autres prestataires...

# providers_no_response
source: Providers did not respond. Trying other providers...
ar: لم يستجب مقدمو الخدمة. جاري المحاولة مع مقدمين آخرين...
fr: Les prestataires n'ont pas répondu. Essai avec d'autres prestataires...

# reachingTimeError
source: Error updating destination arrival time.
ar: خطأ في تحديث وقت الوصول إلى الوجهة.
fr: Erreur lors de la mise à jour de l'heure d'arrivée à la destination.

source: Refresh
ar: تحديث
fr: Actualiser

source: Register
ar: تسجيل
fr: S'inscrire

source: Rent Vehicles
ar: تأجير المركبات
fr: Louer des véhicules

# repairCategory
source: Repair
ar: الإصلاح
fr: Réparation

# report_category
source: Contribute to faster road repairs by reporting issues
ar: ساهم في تسريع اصلاح الطرقات بالتبيغ عنها
fr: Contribuez à des réparations routières plus rapides en signalant les problèmes

source: Report Pothole
ar: الإبلاغ عن حفرة
fr: Signaler un nid-de-poule

# reports_label
source: Reports
ar: تقارير
fr: Rapports

source: Request Car Wash
ar: طلب غسيل سيارة
fr: Demander un lavage de voiture

source: Request Delivery
ar: طلب التوصيل
fr: Demander la livraison

# requestError
source: Failed to save request.
ar: فشل في حفظ الطلب.
fr: Échec de l'enregistrement de la demande.

source: Request Pickup
ar: طلب الاستلام
fr: Demander la prise en charge

# requestSent
source: Request sent to provider.
ar: تم إرسال الطلب إلى المزود.
fr: Demande envoyée au prestataire.

source: Request Service
ar: طلب الخدمة
fr: Demander le service

source: Request Submitted
ar: تم تقديم الطلب
fr: Demande soumise

# request_accepted
source: Request accepted by provider!
ar: تم قبول الطلب من قبل مزود الخدمة!
fr: Demande acceptée par le prestataire !

# request_accepted_body
source: Your request was accepted by
ar: تم قبول طلبك من قبل
fr: Votre demande a été acceptée par

# request_accepted_title
source: Request Accepted
ar: تم قبول الطلب
fr: Demande acceptée

# request_at
source: Requested at
ar: طلب في
fr: Demandé à

source: Request cancelled.
ar: تم إلغاء الطلب.
fr: Demande annulée.

# request_cancelled_message
source: Service request cancelled
ar: تم إلغاء طلب الخدمة
fr: Demande de service annulée

source: Request Delivery
ar: طلب التوصيل
fr: Demander la livraison

source: Request Details
ar: تفاصيل الطلب
fr: Détails de la demande

# request_details_error
source: Please provide request details
ar: يرجى تقديم تفاصيل الطلب
fr: Veuillez fournir les détails de la demande

source: Request Pickup
ar: طلب الاستلام
fr: Demander la prise en charge

# request_queued
source: Request queued to be sent when internet is available
ar: تمت إضافة الطلب إلى قائمة الانتظار ليتم إرساله عند الاتصال بالإنترنت
fr: Demande mise en file d'attente pour être envoyée lorsque la connexion Internet est disponible

source: Request Service
ar: طلب الخدمة
fr: Demander le service

source: Request Service Button
ar: زر طلب الخدمة
fr: Bouton de demande de service

# request_stored
source: Request stored for
ar: تم تخزين الطلب لـ
fr: Demande stockée pour

# request_timeout
source: Request timed out
ar: انتهت مهلة الطلب
fr: Délai de la demande expiré

source: Request Type
ar: نوع الطلب
fr: Type de demande

source: Resend Code
ar: إعادة إرسال الرمز
fr: Renvoyer le code

# resendInSeconds
source: Resend in {seconds} seconds
ar: إعادة الإرسال بعد {seconds} ثانية
fr: Renvoyer dans {seconds} secondes

source: Retry
ar: إعادة المحاولة
fr: Réessayer

source: Retry Connection Button
ar: زر إعادة المحاولة للاتصال
fr: Bouton de nouvelle tentative de connexion

# retrying_location
source: Retrying to fetch location...
ar: جاري إعادة محاولة جلب الموقع...
fr: Nouvelle tentative de récupération de l'emplacement...

source: Return Date
ar: تاريخ التسليم
fr: Date de retour

source: Reviews
ar: مراجعات
fr: Avis

source: Ride cancelled or ended
ar: تم إلغاء الرحلة أو انتهت
fr: Course annulée ou terminée

# ride_info_not_found
source: Ride data not available
ar: بيانات الرحلة غير متوفرة
fr: Données de la course non disponibles

source: Ride status updated
ar: تم تحديث حالة الرحلة
fr: État de la course mis à jour

# road_issue_report_title
source: Report Pothole
ar: الإبلاغ عن حفرة
fr: Signaler un nid-de-poule

source: Roadside Assistance
ar: المساعدة على الطريق
fr: Assistance routière

# routineMaintenanceDescription
source: Periodic vehicle maintenance services
ar: خدمات صيانة المركبة الدورية
fr: Services d'entretien périodique des véhicules

# routineMaintenanceTitle
source: Routine Maintenance
ar: الصيانة الروتينية
fr: Entretien de routine

source: Save
ar: حفظ
fr: Enregistrer

# saveData
source: Save Rental
ar: حفظ التأجير
fr: Enregistrer la location

source: Saved Information
ar: المعلومات المحفوظة
fr: Informations enregistrées

source: Schedule Date
ar: تاريخ الجدولة
fr: Date de planification

# schedule_date_error
source: Please select a date
ar: يرجى اختيار تاريخ
fr: Veuillez sélectionner une date

source: Schedule Time
ar: وقت الجدولة
fr: Heure de planification

# schedule_time_error
source: Please select a time
ar: يرجى اختيار وقت
fr: Veuillez sélectionner une heure

source: Scheduled
ar: مجدول
fr: Planifié

source: Search
ar: بحث
fr: Rechercher

# searchAgain
source: Please try again later
ar: يرجى المحاولة مرة أخرى لاحقًا
fr: Veuillez réessayer plus tard

source: Search Services
ar: البحث عن الخدمات
fr: Rechercher des services

source: Search Vehicles
ar: البحث عن السيارات
fr: Rechercher des véhicules

# search_continued
source: Continuing search for providers...
ar: مواصلة البحث عن مقدمي الخدمة...
fr: Poursuite de la recherche de prestataires...

# search_error
source: Error searching for providers
ar: خطأ في البحث عن مزودين
fr: Erreur lors de la recherche de prestataires

# search_error_try_again
source: Search error. Please try again.
ar: خطأ في البحث. الرجاء المحاولة مرة أخرى.
fr: Erreur de recherche. Veuillez réessayer.

source: Search Location
ar: البحث عن موقع
fr: Rechercher un emplacement

source: Searching for Provider
ar: البحث عن مقدم الخدمة
fr: Recherche de prestataire

source: Searching for
ar: البحث عن
fr: Recherche de

source: Searching for another driver...
ar: جارٍ البحث عن سائق آخر...
fr: Recherche d'un autre chauffeur...

# searching_for_driver
source: Searching for provider...
ar: جاري البحث عن مقدم الخدمة...
fr: Recherche de prestataire...

source: Searching for provider
ar: جاري البحث عن مقدم الخدمة
fr: Recherche de prestataire

source: Searching offline...
ar: جارٍ البحث دون اتصال...
fr: Recherche hors ligne...

source: Secondary Services
ar: الخدمات الثانوية
fr: Services secondaires

source: See More
ar: عرض المزيد
fr: Voir plus

source: Select
ar: اختر
fr: Sélectionner

source: Select Date
ar: اختر التاريخ
fr: Sélectionner une date

# selectLocationFirst
source: Please select a location first
ar: يرجى تحديد الموقع أولاً
fr: Veuillez d'abord sélectionner un emplacement

# selectNumber
source: Select a number to call:
ar: اختر رقماً للاتصال:
fr: Sélectionner un numéro à appeler :

# selectService
source: Please select a service.
ar: يرجى اختيار خدمة.
fr: Veuillez sélectionner un service.

# selectServicePrompt
source: Please select a service
ar: يرجى اختيار خدمة
fr: Veuillez sélectionner un service

source: Select Vehicle Type
ar: اختر نوع المركبة
fr: Sélectionner le type de véhicule

# select_gas_station
source: Select
ar: اختر
fr: Sélectionner

# select_location_first
source: Please select a location first.
ar: يرجى اختيار الموقع أولاً.
fr: Veuillez d'abord sélectionner un emplacement.

# select_provider_to_contact
source: Select a provider to contact directly
ar: اختر مقدم خدمة للتواصل معه مباشرة
fr: Sélectionner un prestataire à contacter directement

source: Self Drive
ar: قيادة ذاتية
fr: Conduite autonome

source: Send
ar: إرسال
fr: Envoyer

# sendAlert
source: Do you really want to send an alert?
ar: هل تريد فعلاً إرسال تنبيه؟
fr: Voulez-vous vraiment envoyer une alerte ?

source: Send Verification Code
ar: إرسال رمز التحقق
fr: Envoyer le code de vérification

source: Service
ar: الخدمة

# serviceCategories
source: Emergency Services
ar: خدمات الطوارئ
fr: Services d'urgence

# serviceDescription
source: Car towing to your desired location
ar: خدمة سحب السيارات إلى الموقع المطلوب
fr: Remorquage de voiture vers l'emplacement souhaité

# serviceTypeError
source: Please select a service type
ar: يرجى اختيار نوع الخدمة
fr: Veuillez sélectionner un type de service

# service_description
source: Request this service at your location
ar: اطلب هذه الخدمة في موقعك
fr: Demandez ce service à votre emplacement

# service_not_available
source: Service Unavailable
ar: الخدمة غير متوفرة
fr: Service non disponible

# service_not_available_message
source: This service is currently under maintenance. Please try again later.
ar: هذه الخدمة قيد الصيانة حاليًا. يرجى المحاولة مرة أخرى لاحقًا.
fr: Ce service est actuellement en maintenance. Veuillez réessayer plus tard.

source: Service Provider
ar: مزود الخدمة
fr: Prestataire de service

source: Service Type
ar: نوع الخدمة
fr: Type de service

source: Services
ar: الخدمات

# servicesCount
source: {count, plural, zero{No services available} one{1 service available} other{{count} services available}}
ar: {count, plural, zero {لا توجد خدمات متاحة} one {خدمة واحدة متاحة} two {خدمتان متاحتان} few {متاح {count} خدمات} many {متاح {count} خدمة} other {متاح {count} خدمة}}
fr: {count, plural, zero{Aucun service disponible} one{1 service disponible} other{{count} services disponibles}}

# setLocationButton
source: Set Location
ar: تحديد الموقع
fr: Définir l'emplacement

source: Settings
ar: الاعدادات
fr: Paramètres

# severity_high
source: High
ar: عالية
fr: Élevé

source: Share
ar: مشاركة
fr: Partager

# shareError
source: Error sharing post
ar: حدث خطأ أثناء مشاركة المنشور
fr: Erreur lors du partage de la publication

# sharePostText
source: Check out this awesome post!
ar: تحقق من هذا المنشور الرائع!
fr: Découvrez cette publication géniale !

source: Shop Now
ar: تسوق الآن
fr: Acheter maintenant

source: Show Stores
ar: إظهار المتاجر
fr: Afficher les magasins

source: Sign In
ar: تسجيل الدخول
fr: Se connecter

source: Sort by Distance
ar: الفرز حسب المسافة
fr: Trier par distance

source: Sort by Name
ar: الفرز حسب الاسم
fr: Trier par nom

source: Sort Providers
ar: فرز مقدمي الخدمة
fr: Trier les prestataires

# sparePartsDescription
source: High-quality spare parts for your vehicle
ar: قطع غيار عالية الجودة لمركبتك
fr: Pièces détachées de haute qualité pour votre véhicule

# sparePartsTitle
source: Spare Parts
ar: قطع الغيار
fr: Pièces détachées

# sparePartsType
source: Spare Parts Sales
ar: بيع قطع غيار
fr: Vente de pièces détachées

source: Sporty Motorcycle
ar: دراجة نارية رياضية
fr: Moto sportive

# stationary_car_wash
source: Stationary
ar: غسيل ثابت
fr: stationnaire

source: Status
ar: الحالة
fr: Statut

source: Store
ar: المتجر
fr: Magasin

# store_service_description
source: Choose a store or select delivery for your service needs
ar: اختر متجرًا أو اختر التوصيل لاحتياجات خدمتك
fr: Choisissez un magasin ou sélectionnez la livraison pour vos besoins de service

source: Subscribe
ar: اشتراك
fr: S'abonner

# subscribed
source: Subscribed successfully
ar: تم الاشتراك بنجاح
fr: Abonnement réussi

# subscriptionError
source: Error updating subscription status
ar: حدث خطأ أثناء تحديث حالة الاشتراك
fr: Erreur lors de la mise à jour du statut d'abonnement

source: Success!
ar: نجاح!
fr: Succès !

source: Support
ar: الدعم

source: SUV
ar: دفع رباعي

source: Tags
ar: الوسوم
fr: Étiquettes

# tags_hint
source: Enter tags, separated by commas (e.g., #car_repair, #maintenance)
ar: أدخل الوسوم، مفصولة بفواصل (مثال: #إصلاح_سيارات، #صيانة)
fr: Entrez des étiquettes, séparées par des virgules (par ex. : #réparation_auto, #entretien)

source: Take Photo
ar: التقاط صورة
fr: Prendre une photo

# taxDisclaimer
source: Prices may not include taxes and fees
ar: الأسعار قد لا تشمل الضرائب والرسوم
fr: Les prix peuvent ne pas inclure les taxes et les frais

# termsAndConditions
source: By continuing, you agree to our terms and conditions.
ar: بالمتابعة، فإنك توافق على الشروط والأحكام الخاصة بنا.
fr: En continuant, vous acceptez nos conditions générales.

# testimonial1
source: Amazing service! My car was fixed in no time.
ar: خدمة مذهلة! تم إصلاح سيارتي في وقت قصير.
fr: Service incroyable ! Ma voiture a été réparée en un rien de temps.

# testimonial2
source: Reliable and affordable. Highly recommend!
ar: موثوق وميسور التكلفة. أوصي به بشدة!
fr: Fiable et abordable. Je recommande vivement !

source: Testimonials
ar: الشهادات
fr: Témoignages

# text
source: Message
ar: الرسالة

source: Thank You
ar: شكرًا
fr: Merci

# thankYouPatience
source: Thank you for your patience!
ar: شكراً لصبرك!
fr: Merci pour votre patience !

source: Time
ar: الوقت
fr: Heure

# timeoutError
source: Request timed out. Please check connection and try again.
ar: انتهت مهلة الطلب. يرجى التحقق من الاتصال والمحاولة مرة أخرى.
fr: Délai de la demande expiré. Veuillez vérifier la connexion et réessayer.

source: Tire Repair
ar: إصلاح الإطارات
fr: Réparation de pneus

# tireRepairDescription
source: On-site tire repair service
ar: خدمة إصلاح الإطارات في الموقع
fr: Service de réparation de pneus sur place

# tireRepairTitle
source: Tire Repair
ar: إصلاح الإطارات
fr: Réparation de pneus

source: Title
ar: عنوان
fr: Titre

source: Total for
ar: الإجمالي لـ
fr: Total pour

# towTruckDescription
source: Car towing to your desired location
ar: سحب السيارة إلى الموقع المطلوب
fr: Remorquage de voiture vers l'emplacement souhaité

# towTruckTitle
source: Towing Service
ar: خدمة سحب السيارات
fr: Service de remorquage

# towTruckType
source: Tow Truck
ar: حاملة
fr: Camion de remorquage

source: Towing Service
ar: خدمة السحب
fr: Service de remorquage

source: Trip cancelled or ended
ar: تم إلغاء الرحلة أو انتهت
fr: Course annulée ou terminée

# trip_in_progress
source: Service in progress
ar: الخدمة قيد التنفيذ
fr: Service en cours

source: Truck
ar: شاحنة
fr: Camion

source: Trucks
ar: شاحنات
fr: Camions

# tryDifferentCityOrDate
source: Try a different city or date!
ar: جرب مدينة أو تاريخ آخر!
fr: Essayez une autre ville ou date !

# tryDifferentDate
source: Try a different date
ar: جرب تاريخ آخر
fr: Essayez une autre date

source: Tutorials
ar: الدروس
fr: Tutoriels

# type_message
source: Send a message
ar: ارسل رسالة
fr: Envoyer un message

# unable_to_create_request
source: Unable to create request. Please try again later.
ar: غير قادر على إنشاء الطلب. يرجى المحاولة لاحقًا.
fr: Impossible de créer la demande. Veuillez réessayer plus tard.

# unable_to_get_location
source: Unable to fetch location. Using default location.
ar: غير قادر على جلب الموقع. استخدام الموقع الافتراضي.
fr: Impossible de récupérer l'emplacement. Utilisation de l'emplacement par défaut.

source: Understood
ar: فهمت
fr: Compris

source: Unknown
ar: غير معروف
fr: Inconnu

source: Unknown Address
ar: عنوان غير معروف
fr: Adresse inconnue

# unknownLocation
source: Unknown
ar: غير معروف
fr: Inconnu

source: Unknown Number
ar: رقم غير معروف
fr: Numéro inconnu

source: Unknown Service
ar: خدمة غير معروفة
fr: Service inconnu

source: Unknown Location
ar: موقع غير معروف
fr: Emplacement inconnu

source: Unlike
ar: إلغاء الإعجاب
fr: Ne plus aimer

# unliked
source: Unliked successfully
ar: تم إلغاء الإعجاب بنجاح
fr: Non aimé avec succès

source: Unspecified
ar: غير محدد
fr: Non spécifié
